Revit 2027 API
FaceArray.Item Property
Gets or sets a face at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Face this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As Face
	Get
	Set
public:
virtual property Face^ Item[int index] {
	Face^ get (int index);
	void set (int index, Face^ value);
}
abstract Item : Face with get, set
override Item : Face with get, set
Parameters
index Int32
The index of the face to be set or retrieved.
Return Value
Face
Returns the face at the specified index.
See Also
Reference
FaceArray Class
Autodesk.Revit.DB Namespace